---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingBearingWidth
source: html/2e80b9d4-649d-1994-bd1d-b182a4bcf767.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingBearingWidth Property

"Width"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousFootingBearingWidth { get; }
```